## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 52 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                           NAME                                            |
|--------|-------------------------------------------------------------------------------------------|
| add    | `aws_flow_log.cloud_based_sensor`                                                         |
|        | `aws_network_acl_rule.port_80`                                                            |
|        | `aws_security_group.weblate_database`                                                     |
|        | `aws_security_group.weblate_ecs`                                                          |
|        | `aws_security_group.weblate_efs`                                                          |
|        | `aws_security_group.weblate_lb`                                                           |
|        | `aws_security_group.weblate_redis`                                                        |
|        | `aws_security_group_rule.weblate_database_ingress_ecs`                                    |
|        | `aws_security_group_rule.weblate_ecs_ingress_lb`                                          |
|        | `aws_security_group_rule.weblate_efs_ingress_ecs`                                         |
|        | `aws_security_group_rule.weblate_egress_database`                                         |
|        | `aws_security_group_rule.weblate_egress_efs`                                              |
|        | `aws_security_group_rule.weblate_egress_internet`                                         |
|        | `aws_security_group_rule.weblate_egress_redis`                                            |
|        | `aws_security_group_rule.weblate_lb_egress_ecs`                                           |
|        | `aws_security_group_rule.weblate_lb_ingress_internet_http`                                |
|        | `aws_security_group_rule.weblate_lb_ingress_internet_https`                               |
|        | `aws_security_group_rule.weblate_redis_ingress_ecs`                                       |
|        | `module.weblate_vpc.aws_default_network_acl.default`                                      |
|        | `module.weblate_vpc.aws_default_route_table.default`                                      |
|        | `module.weblate_vpc.aws_default_security_group.default`                                   |
|        | `module.weblate_vpc.aws_eip.nat[0]`                                                       |
|        | `module.weblate_vpc.aws_internet_gateway.gw`                                              |
|        | `module.weblate_vpc.aws_nat_gateway.nat_gw[0]`                                            |
|        | `module.weblate_vpc.aws_network_acl.main`                                                 |
|        | `module.weblate_vpc.aws_network_acl_rule.block_rdp[0]`                                    |
|        | `module.weblate_vpc.aws_network_acl_rule.block_ssh[0]`                                    |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_egress_443[0]`                     |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_in_ingress_443[0]`                 |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0]`           |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_in_response_egress_443[0]`         |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0]`   |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0]`           |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0]`       |
|        | `module.weblate_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0]` |
|        | `module.weblate_vpc.aws_route.private_nat_gateway[0]`                                     |
|        | `module.weblate_vpc.aws_route.public_internet_gateway`                                    |
|        | `module.weblate_vpc.aws_route_table.private[0]`                                           |
|        | `module.weblate_vpc.aws_route_table.public`                                               |
|        | `module.weblate_vpc.aws_route_table_association.private[0]`                               |
|        | `module.weblate_vpc.aws_route_table_association.private[1]`                               |
|        | `module.weblate_vpc.aws_route_table_association.private[2]`                               |
|        | `module.weblate_vpc.aws_route_table_association.public[0]`                                |
|        | `module.weblate_vpc.aws_route_table_association.public[1]`                                |
|        | `module.weblate_vpc.aws_route_table_association.public[2]`                                |
|        | `module.weblate_vpc.aws_subnet.private[0]`                                                |
|        | `module.weblate_vpc.aws_subnet.private[1]`                                                |
|        | `module.weblate_vpc.aws_subnet.private[2]`                                                |
|        | `module.weblate_vpc.aws_subnet.public[0]`                                                 |
|        | `module.weblate_vpc.aws_subnet.public[1]`                                                 |
|        | `module.weblate_vpc.aws_subnet.public[2]`                                                 |
|        | `module.weblate_vpc.aws_vpc.main`                                                         |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/localisation-services/actions/runs/6832651622).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_flow_log.cloud_based_sensor will be created
  + resource "aws_flow_log" "cloud_based_sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-817721384391/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all                 = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_network_acl_rule.port_80 will be created
  + resource "aws_network_acl_rule" "port_80" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_security_group.weblate_database will be created
  + resource "aws_security_group" "weblate_database" {
      + arn                    = (known after apply)
      + description            = "Weblate database - ingress from ECS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "weblate-database"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.weblate_ecs will be created
  + resource "aws_security_group" "weblate_ecs" {
      + arn                    = (known after apply)
      + description            = "Weblate ECS task"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "weblate-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.weblate_efs will be created
  + resource "aws_security_group" "weblate_efs" {
      + arn                    = (known after apply)
      + description            = "Weblate EFS - ingress from ECS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "weblate-efs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.weblate_lb will be created
  + resource "aws_security_group" "weblate_lb" {
      + arn                    = (known after apply)
      + description            = "Weblate load balancer - ingress from internet, egress to ECS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "weblate-lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.weblate_redis will be created
  + resource "aws_security_group" "weblate_redis" {
      + arn                    = (known after apply)
      + description            = "Weblate Redis - ingress from ECS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "weblate-redis"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.weblate_database_ingress_ecs will be created
  + resource "aws_security_group_rule" "weblate_database_ingress_ecs" {
      + description              = "Ingress from Weblate ECS task to database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.weblate_ecs_ingress_lb will be created
  + resource "aws_security_group_rule" "weblate_ecs_ingress_lb" {
      + description              = "Ingress from load balancer to Weblate ECS task"
      + from_port                = 4443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # aws_security_group_rule.weblate_efs_ingress_ecs will be created
  + resource "aws_security_group_rule" "weblate_efs_ingress_ecs" {
      + description              = "Ingress from Weblate ECS task to EFS"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

  # aws_security_group_rule.weblate_egress_database will be created
  + resource "aws_security_group_rule" "weblate_egress_database" {
      + description              = "Egress from Weblate ECS task to database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.weblate_egress_efs will be created
  + resource "aws_security_group_rule" "weblate_egress_efs" {
      + description              = "Egress from Weblate ECS task to EFS"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "egress"
    }

  # aws_security_group_rule.weblate_egress_internet will be created
  + resource "aws_security_group_rule" "weblate_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress from Weblate ECS task to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.weblate_egress_redis will be created
  + resource "aws_security_group_rule" "weblate_egress_redis" {
      + description              = "Egress from Weblate ECS task to Redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "egress"
    }

  # aws_security_group_rule.weblate_lb_egress_ecs will be created
  + resource "aws_security_group_rule" "weblate_lb_egress_ecs" {
      + description              = "Egress from load balancer to Weblate ECS task"
      + from_port                = 4443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "egress"
    }

  # aws_security_group_rule.weblate_lb_ingress_internet_http will be created
  + resource "aws_security_group_rule" "weblate_lb_ingress_internet_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress from internet to load balancer (HTTP)"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.weblate_lb_ingress_internet_https will be created
  + resource "aws_security_group_rule" "weblate_lb_ingress_internet_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress from internet to load balancer (HTTPS)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.weblate_redis_ingress_ecs will be created
  + resource "aws_security_group_rule" "weblate_redis_ingress_ecs" {
      + description              = "Ingress from Weblate ECS task to Redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.weblate_vpc.aws_default_network_acl.default will be created
  + resource "aws_default_network_acl" "default" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_default_nacl"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_default_nacl"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.weblate_vpc.aws_default_route_table.default will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = []
      + tags                   = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
          + "name"       = "weblate-staging_default_route_table"
        }
      + tags_all               = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
          + "name"       = "weblate-staging_default_route_table"
        }
      + vpc_id                 = (known after apply)
    }

  # module.weblate_vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_default_sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_default_sg"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.weblate_vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging-eip0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging-eip0"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # module.weblate_vpc.aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_internet_gateway"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_internet_gateway"
          + "Terraform"  = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.weblate_vpc.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging-natgw-0"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging-natgw-0"
          + "Terraform"  = "true"
        }
    }

  # module.weblate_vpc.aws_network_acl.main will be created
  + resource "aws_network_acl" "main" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_main_nacl"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_main_nacl"
          + "Terraform"  = "true"
        }
      + vpc_id     = (known after apply)
    }

  # module.weblate_vpc.aws_network_acl_rule.block_rdp[0] will be created
  + resource "aws_network_acl_rule" "block_rdp" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 3389
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 51
      + to_port        = 3389
    }

  # module.weblate_vpc.aws_network_acl_rule.block_ssh[0] will be created
  + resource "aws_network_acl_rule" "block_ssh" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 50
      + to_port        = 22
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_egress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 60
      + to_port        = 443
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_in_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 70
      + to_port        = 443
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 71
      + to_port        = 65535
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_in_response_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 72
      + to_port        = 443
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 73
      + to_port        = 65535
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_egress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 61
      + to_port        = 65535
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 62
      + to_port        = 443
    }

  # module.weblate_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 63
      + to_port        = 65535
    }

  # module.weblate_vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.weblate_vpc.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.weblate_vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_private_route_table_0"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_private_route_table_0"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.weblate_vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_public_route_table"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging_public_route_table"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.weblate_vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.weblate_vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.weblate_vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.weblate_vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.weblate_vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.weblate_vpc.aws_route_table_association.public[2] will be created
  +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
